const blogData = {
  title: 'Reza Nazeri | رضا ناظری',
  posts: [
    {
      title: 'قابلیت params Collections در C# ۱۳',
      description:
        'کد زیر رو درنظر بگیرین:یه تابع به اسم Sample ساختیم که یه آرایه دریافت میکنه و طول آرایه رو چاپ میکنهموقع اجرای تابع، به روش معمول یه آرایه ساختیم و آرایه رو پاس دادیم به تابع. حالا میخوایم ببینیم ویژگی params که تو C# 13 اضافه شده چه تاثیری روی این کد داره:با استفاده از کلمه params در ورودی تابع، این امکان به ما داده میشه که علاوه بر حالت قبل، بتونیم آرایه رو به صورت آیتم های جدا جدا برای تابع ارسال کنیم.این روش برای ساده تر شدن کد، کمکمون میکنه و باعث میشه درگیر کارهای دست و پاگیر ساخت آرایه نشیم.',
      pubDate: '2023-01-01T00:00:00Z',
    },
    {
      title: 'نصب و راه اندازی PHP در ویندوز',
      description:
        'نرم افزار های مورد نیاز:نرم افزار VSCode: دانلودبعد از نصب VSCode پیشنهاد میشه این پلاگین هارو روش نصب کنین: PHP Intelephense و Prettier و Live Serverنرم افزار WAMP: دانلودبعد از نصب WAMP اجراش کنین. یکمی زمان می بره تا آیکونش که کنار ساعت ویندوز هست، رنگش از بنفش به نارنجی و بعد سبز تغییر کنه. بعد از اینکه سبز شد، تو مرورگرتون به این آدرس برین: localhostصفحه ای باز میشه که اطلاعات WAMP رو براتون می نویسه. میتونین ورژن PHP رو از همین صفحه چک کنین. بهتره ورژنش 7.4 یا بالاتر باشه. اگر ورژنش پایین تر بود، روی آیکون WAMP که سبز رنگ شده، کلیک کنین و از بخش PHP ورژن بالاتری رو براش انتخاب کنین.اگه ورژن بالاتر تو لیست نبود، میتونین از این لینک نسخه مدنظرتون رو دانلود و نصب کنین و مرحله قبل رو انجام بدین. اگه بعد از نصب به لیست اضافه نشد، سیستمتون رو restart کنین و دوباره امتحان کنین.نکته: اگه آیکون WAMP تو حالت نارنجی موند و بعد از چند دقیقه سبز نشد، به احتمال زیاد پورت 80 درگیره. پس یا باید پورت 80 رو آزاد کنین، یا پورت WAMP رو تغییر بدین.برای تغییر پورت WAMP، روی آیکون نارنجی WAMP کلیک راست کنین، از منو Tools گزینه Use a port other than 80 رو انتخاب کنین و یه عدد دیگه مثل 8080 وارد کنین. به این صورت مشکل حل میشه و آیکون WAMP سبز میشه.اگر هیچ جوره WAMP نصب نشد، XAMPP رو نصب کنین:دانلود XAMPP: لینک دانلود ۱ - لینک دانلود ۲',
      pubDate: '2023-01-03T00:00:00Z',
    },
  ],
};

export default blogData;
